In [4]:
import pandas as pd
import pdfplumber
pdf = pdfplumber.open(r'test.pdf')
df = pd.DataFrame()
table_settings={"vertical_strategy": "text", 
    "horizontal_strategy": "lines","intersection_y_tolerance": 8}
df = pd.DataFrame(pdf.pages[3].extract_table(table_settings))
df.to_csv(r'test.csv')

In [5]:
df.head()

       0                                   1         2            3        4
0   Date                         Description  Deposits  Withdrawals  Balance
1  04/13                               ZELLE   $224.00               $504.06
2                             ERICA PETERSON
3                               0104P070IGIY
4  04/13  ZELLE\nCYNTHIA ARAYA\n0104P070IDM2   $100.00               $604.06

In [6]:
df = pd.read_csv('test.csv')

In [7]:
df.head()

,Unnamed: 0,0,1,2,3,4
0,0,Date,Description,Deposits,Withdrawals,Balance
1,1,04/13,ZELLE,$224.00,NaN,$504.06
2,2,NaN,ERICA PETERSON,NaN,NaN,NaN
3,3,NaN,0104P070IGIY,NaN,NaN,NaN
4,4,04/13,ZELLE\nCYNTHIA ARAYA\n0104P070IDM2,$100.00,NaN,$604.06

In [8]:
df.fillna(0, inplace = True)

In [15]:
df.head()

,Unnamed: 0,0,1,2,3,4
0,0,Date,Description,Deposits,Withdrawals,Balance
1,1,04/13,ZELLE,$224.00,0,$504.06
2,2,0,ERICA PETERSON,0,0,0
3,3,0,0104P070IGIY,0,0,0
4,4,04/13,ZELLE\nCYNTHIA ARAYA\n0104P070IDM2,$100.00,0,$604.06

In [9]:
deposit = list(df['2'])
deposit_list = []

In [10]:
for i in range(1, len(deposit)):
    if isinstance(deposit[i], int):
        deposit_list.append(deposit[i])
    else:
        new = deposit[i].replace('$', "", 1)
        sub = "."
        new2 = new[:new.index(sub) + len(sub)]
        new2 = new2.replace('.', '', 1)
        new2 = new2.replace(',', '', 1)
        deposit_list.append(int(new2))

In [11]:
su = sum(deposit_list)
avg_deposit = su/len(deposit_list)
print(su)
print(avg_deposit)

4592
148.1290322580645

In [13]:
Withdrawals = list(df['3'])
Withdrawals_list = []
for i in range(1, len(Withdrawals)):
    if isinstance(Withdrawals[i], int):
        Withdrawals_list.append(Withdrawals[i])
    else:
        new = Withdrawals[i].replace('$', "", 1)
        sub = "."
        new2 = new[:new.index(sub) + len(sub)]
        new2 = new2.replace('.', '', 1)
        new2 = new2.replace(',', '', 1)
        Withdrawals_list.append(int(new2))

In [14]:
suu = sum(Withdrawals_list)
avg_Withdrawals = suu/len(Withdrawals_list)
print(suu)
print(avg_Withdrawals)

937
30.225806451612904